# Tipos de Datos y Valores Extraviados

En este JNB se revisará el tema de Tipos de Datos y Valores Extraviados en Pandas.

In [ ]:
print("Hello World!")

Hello World!

In [1]:
import pandas as pd

In [2]:
!wget --no-check-certificate \
    https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv \
    -O titanic.csv

--2023-03-09 21:14:31--  https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.109.133, 185.199.110.133, 185.199.111.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.109.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 60302 (59K) [text/plain]
Saving to: ‘titanic.csv’

titanic.csv         100%[===================>]  58.89K  --.-KB/s    in 0.009s

2023-03-09 21:14:32 (6.15 MB/s) - ‘titanic.csv’ saved [60302/60302]

In [3]:
df = pd.read_csv('titanic.csv')

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df_nse = df[["Name","Sex","Age"]]

In [7]:
df_nse.tail()

                                         Name     Sex   Age
886                     Montvila, Rev. Juozas    male  27.0
887              Graham, Miss. Margaret Edith  female  19.0
888  Johnston, Miss. Catherine Helen "Carrie"  female   NaN
889                     Behr, Mr. Karl Howell    male  26.0
890                       Dooley, Mr. Patrick    male  32.0

In [10]:
df_nse.shape

(714, 3)

In [9]:
df_nse  = df_nse.dropna()

In [14]:
total_pasajeros = len(df_nse)
print(total_pasajeros)

714

### Calcular el porcentaje de hombres y mujeres.

In [11]:
df_hombres = df_nse[df_nse["Sex"]== 'male']

In [15]:
total_hombres = len(df_hombres)
total_mujeres = total_pasajeros - total_hombres
print(f"Total de hombres: {total_hombres/total_pasajeros*100}%")
print(f"Total de mujeres: {total_mujeres/total_pasajeros*100}%")

Total de hombres: 63.4453781512605%
Total de mujeres: 36.554621848739494%

### Calcular cuantos niños/niñas iban a bordo

In [23]:
edad = 20
df_menores = len(df_nse[df_nse["Age"] <= edad])
print(f"Iban {df_menores} pasajeros de {edad} años abordo. Porcentaje {df_menores/total_pasajeros*100} % " )

Iban 179 pasajeros de 20 años abordo. Porcentaje 25.07002801120448 %

In [24]:
df_clases = df[["Survived","Pclass","Name","Sex","Age"]]
df_clases = df_clases.dropna()
df_clases.head()

,Survived,Pclass,Name,Sex,Age
0,0,3,"Braund, Mr. Owen Harris",male,22.0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,1,3,"Heikkinen, Miss. Laina",female,26.0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,0,3,"Allen, Mr. William Henry",male,35.0

In [44]:
total = len(df_clases)
prim_clase = len(df_clases[df_clases["Pclass"]==1])
seg_clase = len(df_clases[df_clases["Pclass"]==2])
ter_clase = len(df_clases[df_clases["Pclass"]==3])

prim_clase_sob = len(df_clases.loc[(df_clases.Pclass==1) & (df_clases.Survived==1)])
seg_clase_sob = len(df_clases.loc[(df_clases.Pclass==2) & (df_clases.Survived==2)])
ter_clase_sob = len(df_clases.loc[(df_clases.Pclass==3) & (df_clases.Survived==3)])


print(f"Total de pasajeros: {total}")
print(f"Total de pasajeros de primera clase: {prim_clase}")
print(f"Total de pasajeros de segunda clase: {seg_clase}")
print(f"Total de pasajeros de tercera clase: {ter_clase}")

print(f"Total sobrevivientes de pasajeros de primera clase: {prim_clase_sob}.Es decir el {prim_clase_sob/prim_clase*100}% de su clase")
print(f"Total sobrevivientes de pasajeros de segunda clase: {seg_clase_sob}. ES decir el {seg_clase_sob/seg_clase*100}% de su clase")
print(f"Total sobrevivientes de pasajeros de tercera clase: {ter_clase_sob}. Es decir el {ter_clase_sob/ter_clase*100}% de su clase")

Total de pasajeros: 714
Total de pasajeros de primera clase: 186
Total de pasajeros de segunda clase: 173
Total de pasajeros de tercera clase: 355
Total sobrevivientes de pasajeros de primera clase: 122.Es decir el 65.59139784946237% de su clase
Total sobrevivientes de pasajeros de segunda clase: 0. ES decir el 0.0% de su clase
Total sobrevivientes de pasajeros de tercera clase: 0. Es decir el 0.0% de su clase